#egrep '[一二三四五六七八九].{0,2}经营情况讨论与分析' 688*.csv | wc -l
#egrep '[一二三四五六七八九].{0,2}报告期内公司所从事的主要业务、经营模式、行业情况及研发情况说明' 688*.csv | wc -l
#egrep '[一二三四五六七八九].{0,2}报告期内核心竞争力分析' 688*.csv | wc -l
#egrep '[一二三四五六七八九].{0,2}风险因素' 688*.csv | wc -l
#egrep '[一二三四五六七八九].{0,2}报告期内主要经营情况' 688*.csv | wc -l
#egrep '[一二三四五六七八九].{0,4}关于公司未来发展的讨论与分析' 688*.csv | wc -l
#egrep '[一二三四五六七八九].{0,2}公司因不适用准则规定或国家秘密' 688*.csv | wc -l
#echo '#################################################################################################'
#echo '二'
#egrep '[(（][一二三四五六七八九][）)]\s*主要业务、主要产品或服务情况' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*主要经营模式' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*所处行业情况' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*核心技术与研发进展' 688*.csv | wc -l
#echo '三'
#egrep '[(（][一二三四五六七八九][）)]\s*核心竞争力分析' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*报告期内发生的导致公司核心竞争力受到严重影响的事件、影响分析及应对措施' 688*.csv | wc -l
#echo '四'
#egrep '[(（][一二三四五六七八九][）)]\s*尚未盈利的风险' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*业绩大幅下滑或亏损的风险' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*核心竞争力风险' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*经营风险' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*财务风险' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*行业风险' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*宏观环境风险' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*存托凭证相关风险' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*其他重大风险' 688*.csv | wc -l
#echo '五'
#egrep '[(（][一二三四五六七八九][）)]\s*主营业务分析' 688*.csv | wc -l
#echo '六'
#egrep '[(（][一二三四五六七八九][）)]\s*行业格局和趋势' 688*.csv | wc -l
#echo '七'
#egrep '[(（][一二三四五六七八九][）)]\s*公司发展战略' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*经营计划' 688*.csv | wc -l
#egrep '[(（][一二三四五六七八九][）)]\s*其他' 688*.csv | wc -l

#egrep '[1-9].{0,3}行业的发展阶段、基本特点、主要技术门槛' 688*.csv | wc -l
#egrep '[1-9].{0,3}公司所处的行业地位分析及其变化情况' 688*.csv | wc -l
#egrep '[1-9].{0,3}报告期内新技术、新产业、新业态、新模式的发展情况和未来发展趋势' 688*.csv | wc -l
#egrep '[1-9].{0,3}核心技术及其先进性以及报告期内的变化情况' 688*.csv | wc -l
#egrep '[1-9].{0,3}报告期内获得的研发成果' 688*.csv | wc -l
#egrep '[1-9].{0,3}研发投入情况表' 688*.csv | wc -l
#egrep '[1-9].{0,3}在研项目情况' 688*.csv | wc -l
#egrep '[1-9].{0,3}研发人员情况' 688*.csv | wc -l
#egrep '[1-9].{0,3}其他说明' 688*.csv | wc -l
egrep '[1-9].{0,3}技术迭代风险' 688*.csv | wc -l
egrep '[1-9].{0,3}研发失败风险' 688*.csv | wc -l
egrep '[1-9].{0,3}技术未能形成产品或实现产业化风险' 688*.csv | wc -l
egrep '[1-9].{0,3}依赖核心技术人员的风险' 688*.csv | wc -l
egrep '[1-9].{0,3}市场风险' 688*.csv | wc -l
egrep '[1-9].{0,3}丧失主要经营资质的风险' 688*.csv | wc -l
egrep '[1-9].{0,3}规模扩大导致的经营管理风险' 688*.csv | wc -l
egrep '[1-9].{0,3}毛利率下滑的风险' 688*.csv | wc -l
egrep '[1-9].{0,3}固定成本上升的风险' 688*.csv | wc -l
